//4. модифицируейте класс Menu:
// строки, представляющие пункты меню, сохраяются в поле (массив строк)
//В классе задан метод, например, int addMenuItem(char* Item), добавляющий пункт меню, и 
// возвращающий номер этого пункта, метод, отображающий меню на экране и предлагающий сделать выбор
// например void processMenu(). Если выбор неверен, то повтор.
// Если выбор верен, вызывается другой метод, через this 
// Создать классы ListMenu и Queue как наследники Menu, переопределяющие void processMenuItem*int ItemNumber) (остальное от базового)

